tests/ycsb/results/bw_bench_20260417_205656/phase2_hotspot.txt
/usr/bin/java  -classpath /tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/conf:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/lib/core-0.17.0.jar:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/redis-binding/lib/commons-pool2-2.4.2.jar:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/redis-binding/lib/jedis-2.9.0.jar:/tmp/redis-cxl-bench-2227/tests/ycsb/ycsb-0.17.0/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-2227/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=16 -p redis.host=127.0.0.1 -p redis.port=6379 -p redis.timeout=30000
Command line: -t -db site.ycsb.db.RedisClient -s -P /tmp/redis-cxl-bench-2227/tests/ycsb/workloads/workload_bw_saturate -p operationcount=2000000 -p threadcount=16 -p redis.host=127.0.0.1 -p redis.port=6379 -p redis.timeout=30000
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-04-17 21:02:03:874 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-04-17 21:02:13:818 10 sec: 39048 operations; 3904.8 current ops/sec; est completion in 8 minutes [READ: Count=31122, Max=44415, Min=148, Avg=3965.11, 90=6943, 99=15047, 99.9=25247, 99.99=43775] [UPDATE: Count=7940, Max=36447, Min=167, Avg=4327.4, 90=7415, 99=15863, 99.9=26479, 99.99=36319] 
2026-04-17 21:02:23:818 20 sec: 89802 operations; 5075.4 current ops/sec; est completion in 7 minutes [READ: Count=40684, Max=24495, Min=47, Avg=3109.65, 90=5547, 99=12679, 99.9=18287, 99.99=23023] [UPDATE: Count=10073, Max=24383, Min=53, Avg=3284.76, 90=5691, 99=12631, 99.9=19167, 99.99=24383] 
2026-04-17 21:02:33:818 30 sec: 123152 operations; 3335 current ops/sec; est completion in 7 minutes [READ: Count=26861, Max=114559, Min=98, Avg=4737.29, 90=9631, 99=37407, 99.9=65983, 99.99=95359] [UPDATE: Count=6472, Max=95167, Min=114, Avg=4994.64, 90=10015, 99=37375, 99.9=69503, 99.99=94975] 
2026-04-17 21:02:43:818 40 sec: 155761 operations; 3260.9 current ops/sec; est completion in 7 minutes [READ: Count=26156, Max=122559, Min=81, Avg=4859.76, 90=10543, 99=30815, 99.9=65919, 99.99=119295] [UPDATE: Count=6457, Max=121855, Min=161, Avg=5076.93, 90=10959, 99=30847, 99.9=82431, 99.99=119167] 
2026-04-17 21:02:53:818 50 sec: 192326 operations; 3656.5 current ops/sec; est completion in 7 minutes [READ: Count=29451, Max=92927, Min=38, Avg=4329.68, 90=8287, 99=24847, 99.9=65727, 99.99=92671] [UPDATE: Count=7128, Max=92991, Min=182, Avg=4534.91, 90=8607, 99=24767, 99.9=61855, 99.99=92735] 
2026-04-17 21:03:03:818 60 sec: 250129 operations; 5780.3 current ops/sec; est completion in 7 minutes [READ: Count=46214, Max=89087, Min=49, Avg=2723.83, 90=4899, 99=16143, 99.9=55519, 99.99=70719] [UPDATE: Count=11585, Max=88959, Min=75, Avg=2926.33, 90=5139, 99=17327, 99.9=63999, 99.99=86783] 
2026-04-17 21:03:13:818 70 sec: 303354 operations; 5322.5 current ops/sec; est completion in 6 minutes [READ: Count=42697, Max=112703, Min=37, Avg=2977.77, 90=5771, 99=17983, 99.9=47999, 99.99=112447] [UPDATE: Count=10518, Max=112639, Min=55, Avg=3096.3, 90=5839, 99=18063, 99.9=49535, 99.99=112575] 
2026-04-17 21:03:23:818 80 sec: 359124 operations; 5577 current ops/sec; est completion in 6 minutes [READ: Count=44681, Max=202239, Min=32, Avg=2841.9, 90=5167, 99=12375, 99.9=21407, 99.99=202111] [UPDATE: Count=11090, Max=202239, Min=75, Avg=2962.38, 90=5403, 99=11855, 99.9=19775, 99.99=200703] 
2026-04-17 21:03:33:820 90 sec: 432480 operations; 7334.87 current ops/sec; est completion in 5 minutes [READ: Count=58839, Max=29807, Min=33, Avg=2149.25, 90=3981, 99=8911, 99.9=16655, 99.99=21759] [UPDATE: Count=14557, Max=21599, Min=55, Avg=2290.73, 90=4223, 99=9327, 99.9=16543, 99.99=21183] 
2026-04-17 21:03:43:818 100 sec: 516463 operations; 8399.14 current ops/sec; est completion in 4 minutes [READ: Count=67099, Max=20127, Min=35, Avg=1876.84, 90=3453, 99=7135, 99.9=11735, 99.99=19503] [UPDATE: Count=16842, Max=20063, Min=34, Avg=2002.62, 90=3669, 99=7431, 99.9=12311, 99.99=19663] 
2026-04-17 21:03:53:818 110 sec: 594550 operations; 7808.7 current ops/sec; est completion in 4 minutes [READ: Count=62519, Max=16511, Min=33, Avg=2019.29, 90=3709, 99=7627, 99.9=12743, 99.99=15487] [UPDATE: Count=15566, Max=16431, Min=58, Avg=2152.39, 90=3853, 99=7895, 99.9=13383, 99.99=15943] 
2026-04-17 21:04:03:818 120 sec: 668245 operations; 7369.5 current ops/sec; est completion in 4 minutes [READ: Count=58962, Max=22191, Min=47, Avg=2140.04, 90=3919, 99=9199, 99.9=15519, 99.99=20559] [UPDATE: Count=14736, Max=21727, Min=75, Avg=2278.09, 90=4179, 99=9671, 99.9=15727, 99.99=21455] 
2026-04-17 21:04:13:818 130 sec: 712215 operations; 4397 current ops/sec; est completion in 3 minutes [READ: Count=35205, Max=109759, Min=75, Avg=3608.65, 90=7075, 99=21215, 99.9=49823, 99.99=74751] [UPDATE: Count=8769, Max=63775, Min=68, Avg=3727.77, 90=7183, 99=20991, 99.9=42335, 99.99=63167] 
2026-04-17 21:04:23:818 140 sec: 795098 operations; 8288.3 current ops/sec; est completion in 3 minutes [READ: Count=66441, Max=52095, Min=46, Avg=1909.13, 90=3545, 99=8343, 99.9=15663, 99.99=46079] [UPDATE: Count=16455, Max=51935, Min=85, Avg=2001.5, 90=3675, 99=8143, 99.9=19183, 99.99=45695] 
2026-04-17 21:04:33:818 150 sec: 848540 operations; 5344.2 current ops/sec; est completion in 3 minutes [READ: Count=42702, Max=80511, Min=49, Avg=2958.71, 90=5595, 99=21663, 99.9=51039, 99.99=76607] [UPDATE: Count=10732, Max=77247, Min=73, Avg=3114.84, 90=5895, 99=22959, 99.9=48063, 99.99=76991] 
2026-04-17 21:04:43:818 160 sec: 928906 operations; 8035.8 current ops/sec; est completion in 3 minutes [READ: Count=63999, Max=47647, Min=24, Avg=1954.04, 90=3535, 99=10159, 99.9=35615, 99.99=43679] [UPDATE: Count=16357, Max=47359, Min=58, Avg=2122.71, 90=3725, 99=11031, 99.9=40159, 99.99=43711] 
2026-04-17 21:04:53:818 170 sec: 1009497 operations; 8059.91 current ops/sec; est completion in 2 minutes [READ: Count=64511, Max=46911, Min=44, Avg=1964.9, 90=3551, 99=10247, 99.9=33471, 99.99=44831] [UPDATE: Count=16080, Max=44799, Min=46, Avg=2054.11, 90=3699, 99=10271, 99.9=32287, 99.99=40575] 
2026-04-17 21:05:03:818 180 sec: 1088849 operations; 7935.2 current ops/sec; est completion in 2 minutes [READ: Count=63560, Max=42303, Min=24, Avg=1990.1, 90=3597, 99=10135, 99.9=31855, 99.99=42079] [UPDATE: Count=15789, Max=42303, Min=68, Avg=2109.83, 90=3817, 99=10255, 99.9=30239, 99.99=41279] 
2026-04-17 21:05:13:818 190 sec: 1169226 operations; 8037.7 current ops/sec; est completion in 2 minutes [READ: Count=64170, Max=104255, Min=20, Avg=1960.51, 90=3529, 99=9879, 99.9=35135, 99.99=102591] [UPDATE: Count=16226, Max=102591, Min=32, Avg=2095.23, 90=3697, 99=10175, 99.9=37119, 99.99=102015] 
2026-04-17 21:05:23:817 200 sec: 1251182 operations; 8195.6 current ops/sec; est completion in 2 minutes [READ: Count=65460, Max=54751, Min=32, Avg=1922.17, 90=3495, 99=10031, 99.9=33279, 99.99=52607] [UPDATE: Count=16482, Max=53151, Min=55, Avg=2059.7, 90=3653, 99=10983, 99.9=35743, 99.99=52607] 
2026-04-17 21:05:33:817 210 sec: 1332196 operations; 8101.4 current ops/sec; est completion in 1 minute [READ: Count=64701, Max=46559, Min=21, Avg=1953.25, 90=3575, 99=10263, 99.9=34719, 99.99=38495] [UPDATE: Count=16323, Max=46655, Min=59, Avg=2047.47, 90=3743, 99=10351, 99.9=35519, 99.99=38367] 
2026-04-17 21:05:43:818 220 sec: 1393461 operations; 6126.5 current ops/sec; est completion in 1 minute [READ: Count=49037, Max=189439, Min=37, Avg=2575.59, 90=4551, 99=20671, 99.9=49791, 99.99=181503] [UPDATE: Count=12223, Max=189311, Min=59, Avg=2742.41, 90=4795, 99=21487, 99.9=46303, 99.99=189311] 
2026-04-17 21:05:53:818 230 sec: 1443258 operations; 4979.7 current ops/sec; est completion in 1 minute [READ: Count=39898, Max=55967, Min=55, Avg=3176.24, 90=6359, 99=19151, 99.9=35583, 99.99=54239] [UPDATE: Count=9900, Max=55679, Min=71, Avg=3339.44, 90=6575, 99=20287, 99.9=35263, 99.99=54367] 
2026-04-17 21:06:03:818 240 sec: 1548612 operations; 10535.4 current ops/sec; est completion in 1 minute [READ: Count=84244, Max=18911, Min=40, Avg=1501.9, 90=2853, 99=6131, 99.9=11423, 99.99=15599] [UPDATE: Count=21104, Max=15855, Min=58, Avg=1574.95, 90=2973, 99=6387, 99.9=11911, 99.99=15447] 
2026-04-17 21:06:13:817 250 sec: 1668581 operations; 11996.9 current ops/sec; est completion in 50 seconds [READ: Count=95968, Max=22815, Min=24, Avg=1318.65, 90=2485, 99=4755, 99.9=9191, 99.99=21007] [UPDATE: Count=24006, Max=22863, Min=54, Avg=1383.38, 90=2583, 99=4851, 99.9=9247, 99.99=13255] 
2026-04-17 21:06:23:818 260 sec: 1791482 operations; 12290.1 current ops/sec; est completion in 31 seconds [READ: Count=98487, Max=17471, Min=27, Avg=1289.04, 90=2453, 99=4847, 99.9=9495, 99.99=16895] [UPDATE: Count=24406, Max=17487, Min=44, Avg=1343.85, 90=2505, 99=4911, 99.9=9311, 99.99=17135] 
2026-04-17 21:06:33:817 270 sec: 1902032 operations; 11055 current ops/sec; est completion in 14 seconds [READ: Count=88508, Max=20399, Min=29, Avg=1431.83, 90=2721, 99=5479, 99.9=11935, 99.99=16367] [UPDATE: Count=22047, Max=20479, Min=70, Avg=1497.6, 90=2815, 99=5563, 99.9=11895, 99.99=16223] 
2026-04-17 21:06:42:359 278 sec: 2000000 operations; 11468.98 current ops/sec; [READ: Count=78227, Max=14079, Min=19, Avg=1361.48, 90=2611, 99=5343, 99.9=10103, 99.99=12743] [CLEANUP: Count=16, Max=3271, Min=49, Avg=299.12, 90=162, 99=3271, 99.9=3271, 99.99=3271] [UPDATE: Count=19734, Max=13303, Min=31, Avg=1435.31, 90=2737, 99=5527, 99.9=10479, 99.99=13127] 
[OVERALL], RunTime(ms), 278542
[OVERALL], Throughput(ops/sec), 7180.245708008128
[TOTAL_GCS_G1_Young_Generation], Count, 99
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 138
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.04954369538525609
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 99
[TOTAL_GC_TIME], Time(ms), 138
[TOTAL_GC_TIME_%], Time(%), 0.04954369538525609
[READ], Operations, 1600403
[READ], AverageLatency(us), 2199.0956146670555
[READ], MinLatency(us), 19
[READ], MaxLatency(us), 202239
[READ], 95thPercentileLatency(us), 5715
[READ], 99thPercentileLatency(us), 12479
[READ], Return=OK, 1600403
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 299.125
[CLEANUP], MinLatency(us), 49
[CLEANUP], MaxLatency(us), 3271
[CLEANUP], 95thPercentileLatency(us), 164
[CLEANUP], 99thPercentileLatency(us), 3271
[UPDATE], Operations, 399597
[UPDATE], AverageLatency(us), 2319.8306668968985
[UPDATE], MinLatency(us), 31
[UPDATE], MaxLatency(us), 202239
[UPDATE], 95thPercentileLatency(us), 5983
[UPDATE], 99thPercentileLatency(us), 12799
[UPDATE], Return=OK, 399597